[
    {
      "quote": "As you go through life you'll see There is so much that we Don't understand And the only thing we know Is things don't always go The way we planned",
      "author": "Simba",
      "source": "Lion King 2"
    },
    {
      "quote": "‘\"Learned helplessness\" is often learned help less-ness. If efforts to help are met with doubt, cynicism, finger pointing and skepticism...people offer to help less.’",
      "author": "John Cutler",
      "source": ""
    },
    {
      "quote": "We're not here to just make it pretty easy to use. Through empathy. We ensure meaning and utility. With craft we elicit understanding and desire. We wrangle the complexity of our offering to deliver a clear, coherent and satisfying experience from start to finish.",
      "author": "Peter Merholz & Kristin Skinner",
      "source": "Org design for design orgs"
    },
    {
      "quote": "O my brothers, break, break the old tablets!",
      "author": "Friedrich Nietzsche",
      "source": "Thus Spoke Zarathustra"
    },
    {
      "quote": "Make sure—as quickly and as cheaply as you can—that you are building The Right It before you build It right.",
      "author": "Alberto Savoia",
      "source": "Pretotype It"
    },
    {
      "quote": "There is nothing so useless as doing efficiently that which should not be done at all.",
      "author": "Jez Humble",
      "source": "Lean Enterprise"
    },
    {
      "quote": "Design is really an act of communication, which means having a deep understanding of the person with whom the designer is communicating.",
      "author": "Donald A. Norman",
      "source": "The Design of Everyday Things"
    },
    {
      "quote": "Product teams make decisions every day. Our goal with continuous discovery is to infuse those daily decisions with as much customer input as possible.",
      "author": "Teresa Torres",
      "source": "Continuous Discovery Habits"
    },
    {
      "quote": "What cannot be made simple cannot be made clear and what is not clear will not get done.",
      "author": "Stephen Bungay",
      "source": "The Art of Action"
    },
    {
      "quote": "Users need to be able to find content before they can use it — findability precedes usability.",
      "author": "Louis Rosenfeld",
      "source": "Information Architecture"
    },
    {
      "quote": "Our goal is not to create a deliverable, it’s to change something in the world — to create an outcome.",
      "author": "Jeff Gothelf",
      "source": "Lean UX"
    },
    {
      "quote": "When faced with two or more alternatives that deliver roughly the same value, take the path that makes future change easier.",
      "author": "Dave Thomas",
      "source": "Agile is Dead (Long Live Agility)"
    },
    {
      "quote": "the modern world the power to persuade is the most important source of social power. But with such persuasiveness, you tend to convince yourself that you are correct, and you become less sensitive to others’ wishes, interests, and plights.",
      "author": "Simon Johnson",
      "source": "Power and Progress"
    },
    {
      "quote": "the corporate world is littered with concept videos, detailed mockups, and other scenarios of possible futures. Their success is instead shown in how the vision catalyses action, inspiring the people within a company to charge forward because they want to live in a world where that vision is made a reality.",
      "author": "Peter Merholz",
      "source": "Org Design for Design Orgs"
    },
    {
      "quote": "If you want to build a ship, don’t drum up people to collect wood and don’t assign them tasks and work, but rather teach them to long for the endless immensity of the sea.",
      "author": "Kim Malone Scott",
      "source": "Radical Candour"
    },
    {
      "quote": "The first truth is that at least half of our ideas are just not going to work. There are many reasons for an idea to not work out. The most common is that customers just aren't as excited about this idea as we are.",
      "author": "Marty Cagan",
      "source": "INSPIRED"
    },
    {
        "quote": "So how does the… brain… get built from such a small recipe book? The answer… build incompletely and let world experience refine. Thus, for humans at birth, the brain is remarkably unfinished, and interaction with the world is necessary to complete it.",
        "author": "David Eagleman",
        "source": "Livewired"
      },
      {
        "quote": "An abnormal reaction to an abnormal situation is normal behaviour.",
        "author": "Victor Frankl",
        "source": "Man’s search for meaning"
      },
      {
        "quote": "People employ products and services to get their job done, not to interact with your organization.",
        "author": "Jim Kalbach",
        "source": "The Jobs To Be Done Playbook"
      }
]
